# IsValidHost Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricSheet..::..IsValidHost Method
FabricSheet Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidHost(Element) | Checks whether an element is a valid host for fabric sheet. |
| IsValidHost(Document, ElementId) | Checks whether an element is a valid host for fabric sheet. |

# See Also
FabricSheet Class
FabricSheet Members
Autodesk.Revit.DB.Structure Namespace